test-sacha.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-09 Thu 16:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sacha Theme Test - Hand-Drawn Aesthetic Demo</title>
<meta name="author" content="Test Author" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600&family=Kalam:wght@300;400;500&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="src/sacha_theme/css/sacha.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Sacha Theme Test - Hand-Drawn Aesthetic Demo</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org12f96e4">1. Welcome to the Sacha Theme</a>
<ul>
<li><a href="#org61a0619">1.1. ✽ Features Overview</a></li>
<li><a href="#orgd5c3ee9">1.2. ✽ Typography Tests</a>
<ul>
<li><a href="#org7ff15df">1.2.1. Handwriting Font (Headings)</a></li>
<li><a href="#org7834539">1.2.2. Body Text</a></li>
</ul>
</li>
<li><a href="#org68f7106">1.3. ✽ Links and Navigation</a></li>
<li><a href="#orgab04c21">1.4. ✽ Code Examples</a>
<ul>
<li><a href="#org90113da">1.4.1. Inline Code</a></li>
<li><a href="#org8c43f7a">1.4.2. Code Blocks</a></li>
<li><a href="#orgf840b4d">1.4.3. Shell Commands</a></li>
</ul>
</li>
<li><a href="#org0f8ea1a">1.5. ✽ Lists and Tasks</a>
<ul>
<li><a href="#org800ef8f">1.5.1. Unordered Lists</a></li>
<li><a href="#org8aaeb85">1.5.2. Task Lists</a></li>
<li><a href="#org216cfa4">1.5.3. Keyword Lists</a></li>
</ul>
</li>
<li><a href="#org6dcde26">1.6. ✽ Blockquotes and Asides</a></li>
<li><a href="#org4ceedce">1.7. ✽ Tables</a></li>
<li><a href="#orgf72081d">1.8. ✽ Admonitions</a></li>
<li><a href="#org68365c4">1.9. ✽ Definition Lists</a></li>
<li><a href="#org51bb644">1.10. ✽ Center and Example Blocks</a></li>
<li><a href="#org3bc3efc">1.11. ✽ Footnotes</a></li>
<li><a href="#orgb53ba9a">1.12. ✽ Tags</a></li>
<li><a href="#orgefee775">1.13. ✽ Verbatim and Math</a></li>
<li><a href="#org47d58d8">1.14. ✽ Verse</a></li>
<li><a href="#org315b0f4">1.15. ✽ Custom Metadata Display</a></li>
<li><a href="#org8ee269f">1.16. ✽ Timestamps</a></li>
<li><a href="#org94a511f">1.17. ✽ Signatures</a></li>
<li><a href="#orge3e7262">1.18. ✽ Horizontal Rules</a></li>
<li><a href="#orgdb0ab3e">1.19. ✽ More Typography</a></li>
<li><a href="#orgd305e7a">1.20. ✽ Link Styles</a></li>
<li><a href="#orgef9c020">1.21. ✽ Mobile Responsiveness</a></li>
<li><a href="#org9e16a02">1.22. ✽ Summary</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org12f96e4" class="outline-2">
<h2 id="org12f96e4"><span class="section-number-2">1.</span> Welcome to the Sacha Theme</h2>
<div class="outline-text-2" id="text-1">
<p>
This demonstrates the hand-drawn, friendly aesthetic inspired by Sacha Chua's style.
</p>

<p>
:RATING: ★★★★★
:PREP<sub>TIME</sub>: 5 min
</p>
</div>
<div id="outline-container-org61a0619" class="outline-3">
<h3 id="org61a0619"><span class="section-number-3">1.1.</span> ✽ Features Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Here's what makes this theme special:
</p>

<ul class="org-ul">
<li>Warm paper-like background (#faf7f2)</li>
<li>Handwriting fonts for headings and accents</li>
<li>Dotted/wavy link underlines</li>
<li>Irregular borders for organic feel</li>
<li>Custom list markers with pencil-style dots</li>
<li>Code blocks with sepia backgrounds</li>
</ul>
</div>
</div>
<div id="outline-container-orgd5c3ee9" class="outline-3">
<h3 id="orgd5c3ee9"><span class="section-number-3">1.2.</span> ✽ Typography Tests</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org7ff15df" class="outline-4">
<h4 id="org7ff15df"><span class="section-number-4">1.2.1.</span> Handwriting Font (Headings)</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
This heading uses the Kalam handwriting font.
</p>
</div>
<ol class="org-ol">
<li><a id="org6762c6d"></a>Another Level<br>
<div class="outline-text-5" id="text-1-2-1-1">
<p>
Even deeper nesting uses the same friendly style.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7834539" class="outline-4">
<h4 id="org7834539"><span class="section-number-4">1.2.2.</span> Body Text</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
This is regular body text using Inter font for readability. It contrasts nicely with the handwriting headings.
</p>
</div>
</div>
</div>
<div id="outline-container-org68f7106" class="outline-3">
<h3 id="org68f7106"><span class="section-number-3">1.3.</span> ✽ Links and Navigation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Here's a <a href="https://example.com">sample link</a> with a dotted underline. When you hover over it, the underline becomes wavy.
</p>

<p>
Another <a href="test.html">file link</a> and .
</p>
</div>
</div>
<div id="outline-container-orgab04c21" class="outline-3">
<h3 id="orgab04c21"><span class="section-number-3">1.4.</span> ✽ Code Examples</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org90113da" class="outline-4">
<h4 id="org90113da"><span class="section-number-4">1.4.1.</span> Inline Code</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Use <code>code</code> for inline snippets and <code>emacs-lisp</code> for language hints.
</p>
</div>
</div>
<div id="outline-container-org8c43f7a" class="outline-4">
<h4 id="org8c43f7a"><span class="section-number-4">1.4.2.</span> Code Blocks</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #f8ec59;">defun</span> <span style="color: #56b4e9;">hello-world</span> ()
  <span style="color: #e69f00;">"Say hello in the friendliest way."</span>
  (message <span style="color: #ff00ff;">"Hello, World!"</span>))

(hello-world)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf840b4d" class="outline-4">
<h4 id="orgf840b4d"><span class="section-number-4">1.4.3.</span> Shell Commands</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #fcfbe3;">echo</span> <span style="color: #ff00ff;">"Hello from shell!"</span>
<span style="color: #fcfbe3;">echo</span> <span style="color: #ff00ff;">"This looks great in monospace font."</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0f8ea1a" class="outline-3">
<h3 id="org0f8ea1a"><span class="section-number-3">1.5.</span> ✽ Lists and Tasks</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org800ef8f" class="outline-4">
<h4 id="org800ef8f"><span class="section-number-4">1.5.1.</span> Unordered Lists</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
● First item with custom bullet
● Second item
</p>
<ul class="org-ul">
<li>Nested item with dashed marker</li>
<li>Another nested item</li>
</ul>
<p>
● Third item
</p>
</div>
</div>
<div id="outline-container-org8aaeb85" class="outline-4">
<h4 id="org8aaeb85"><span class="section-number-4">1.5.2.</span> Task Lists</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> TODO Item to do</li>
<li class="on"><code>[X]</code> DONE Completed item</li>
<li class="off"><code>[&#xa0;]</code> CANCELLED Cancelled item</li>
<li class="off"><code>[&#xa0;]</code> WAITING Waiting on someone</li>
</ul>
</div>
</div>
<div id="outline-container-org216cfa4" class="outline-4">
<h4 id="org216cfa4"><span class="section-number-4">1.5.3.</span> Keyword Lists</h4>
<div class="outline-text-4" id="text-1-5-3">
<blockquote>
<p>
Keywords in Org mode:
</p>
<ul class="org-ul">
<li>:ACTIVE: Current projects</li>
<li>:ARCHIVE: Archived tasks</li>
<li>:NEXT: Next actions</li>
</ul>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org6dcde26" class="outline-3">
<h3 id="org6dcde26"><span class="section-number-3">1.6.</span> ✽ Blockquotes and Asides</h3>
<div class="outline-text-3" id="text-1-6">
<blockquote>
<p>
"The best way to predict the future is to invent it."
</p>
<ul class="org-ul">
<li>Alan Kay</li>
</ul>

<p>
This quote has a warm accent border and italic text.
</p>
</blockquote>

<div class="ASIDE" id="orgbd37ceb">
<p>
This aside box provides extra context or notes in a styled container.
</p>

</div>
</div>
</div>
<div id="outline-container-org4ceedce" class="outline-3">
<h3 id="org4ceedce"><span class="section-number-3">1.7.</span> ✽ Tables</h3>
<div class="outline-text-3" id="text-1-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Priority</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Font</td>
<td class="org-left">✅</td>
<td class="org-left">High</td>
</tr>

<tr>
<td class="org-left">Colors</td>
<td class="org-left">✅</td>
<td class="org-left">High</td>
</tr>

<tr>
<td class="org-left">Borders</td>
<td class="org-left">✅</td>
<td class="org-left">Medium</td>
</tr>

<tr>
<td class="org-left">Code</td>
<td class="org-left">✅</td>
<td class="org-left">High</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf72081d" class="outline-3">
<h3 id="orgf72081d"><span class="section-number-3">1.8.</span> ✽ Admonitions</h3>
<div class="outline-text-3" id="text-1-8">
<div class="NOTE" id="org391fcca">
<p>
This is a note - useful for general information with a blue tint.
</p>

</div>

<div class="TIP" id="org2a8e487">
<p>
This is a tip - great for helpful hints with a green tint.
</p>

</div>

<div class="WARNING" id="org429366a">
<p>
This is a warning - use orange to draw attention to important info.
</p>

</div>

<div class="DANGER" id="orgad31c23">
<p>
This is a danger box - red for critical alerts or important warnings.
</p>

</div>
</div>
</div>
<div id="outline-container-org68365c4" class="outline-3">
<h3 id="org68365c4"><span class="section-number-3">1.9.</span> ✽ Definition Lists</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Spaced Repetition :: Learning technique with increasing intervals
Active Recall :: Testing yourself rather than re-reading
Forgetting Curve :: Exponential loss of information over time
</p>
</div>
</div>
<div id="outline-container-org51bb644" class="outline-3">
<h3 id="org51bb644"><span class="section-number-3">1.10.</span> ✽ Center and Example Blocks</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-center">
<p>
This text is centered with a special style.
It's perfect for quotes or important messages.
</p>
</div>

<pre class="example" id="org7efea9f">
This example block has a dashed border.
It's great for showing formatted text that shouldn't be styled.
Line 2 of the example
Line 3 continues here
</pre>

<blockquote>
<p>
This quote block has a solid border.
Different from the center and example styles.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org3bc3efc" class="outline-3">
<h3 id="org3bc3efc"><span class="section-number-3">1.11.</span> ✽ Footnotes</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Here's some text with a footnote reference.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
And another sentence with .
</p>
</div>
</div>
<div id="outline-container-orgb53ba9a" class="outline-3">
<h3 id="orgb53ba9a"><span class="section-number-3">1.12.</span> ✽ Tags</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Here's a <code>tagged</code> item with <code>:work:</code> and <code>:personal:</code> tags visible.
</p>
</div>
</div>
<div id="outline-container-orgefee775" class="outline-3">
<h3 id="orgefee775"><span class="section-number-3">1.13.</span> ✽ Verbatim and Math</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Verbatim text: @verbatim@example@
</p>

<p>
Math expression: \(E = mc^2\)
</p>
</div>
</div>
<div id="outline-container-org47d58d8" class="outline-3">
<h3 id="org47d58d8"><span class="section-number-3">1.14.</span> ✽ Verse</h3>
<div class="outline-text-3" id="text-1-14">
<p class="verse">
Roses are red,<br>
Violets are blue,<br>
Code compiles fine,<br>
And so do you!<br>
</p>
</div>
</div>
<div id="outline-container-org315b0f4" class="outline-3">
<h3 id="org315b0f4"><span class="section-number-3">1.15.</span> ✽ Custom Metadata Display</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Since Org properties don't export to HTML by default, here's how we display metadata using custom formatting:
</p>

<blockquote>
<p>
:RATING: ★★★★★
:PREP<sub>TIME</sub>: 5 min
:CATEGORY: Testing
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org8ee269f" class="outline-3">
<h3 id="org8ee269f"><span class="section-number-3">1.16.</span> ✽ Timestamps</h3>
<div class="outline-text-3" id="text-1-16">
<p>
The document was created on <a href="test.html">2024-01-15 Mon</a>.
</p>
</div>
</div>
<div id="outline-container-org94a511f" class="outline-3">
<h3 id="org94a511f"><span class="section-number-3">1.17.</span> ✽ Signatures</h3>
<div class="outline-text-3" id="text-1-17">
<div class="HTML" id="org392dd4d">
<p>
&lt;div class="signature"&gt;
  <code>Test Author</code>
&lt;/div&gt;
</p>

</div>
</div>
</div>
<div id="outline-container-orge3e7262" class="outline-3">
<h3 id="orge3e7262"><span class="section-number-3">1.18.</span> ✽ Horizontal Rules</h3>
<div class="outline-text-3" id="text-1-18">
<p>
-&#x2014;
</p>

<p>
This is a doodle-style horizontal rule with an asterisk divider.
</p>
</div>
</div>
<div id="outline-container-orgdb0ab3e" class="outline-3">
<h3 id="orgdb0ab3e"><span class="section-number-3">1.19.</span> ✽ More Typography</h3>
<div class="outline-text-3" id="text-1-19">
<p>
<b>Strong text</b> and <span class="underline">italic text</span> and <code>verbatim text</code>.
</p>

<p>
<code>Code</code> looks great in the monospace font.
</p>
</div>
</div>
<div id="outline-container-orgd305e7a" class="outline-3">
<h3 id="orgd305e7a"><span class="section-number-3">1.20.</span> ✽ Link Styles</h3>
<div class="outline-text-3" id="text-1-20">
<ul class="org-ul">
<li>Regular link: <a href="https://sachachua.com">Sacha Chua's blog</a></li>
<li>File link: <a href="test.html">this test file</a></li>
<li>ID link:</li>
</ul>
</div>
</div>
<div id="outline-container-orgef9c020" class="outline-3">
<h3 id="orgef9c020"><span class="section-number-3">1.21.</span> ✽ Mobile Responsiveness</h3>
<div class="outline-text-3" id="text-1-21">
<p>
This theme is fully responsive. Try resizing your browser window - the container adjusts and fonts scale appropriately.
</p>

<p>
On small screens:
</p>
<ul class="org-ul">
<li>Container padding decreases</li>
<li>Font sizes use clamp() for smooth scaling</li>
<li>Tables remain readable</li>
</ul>
</div>
</div>
<div id="outline-container-org9e16a02" class="outline-3">
<h3 id="org9e16a02"><span class="section-number-3">1.22.</span> ✽ Summary</h3>
<div class="outline-text-3" id="text-1-22">
<p>
The Sacha theme provides:
</p>

<ol class="org-ol">
<li>Friendly, hand-drawn aesthetic</li>
<li>Warm, paper-like colors</li>
<li>Readable typography with good contrast</li>
<li>Comprehensive Org mode element support</li>
<li>Mobile responsive design</li>
</ol>

<p>
<b>That's all for now!</b>
</p>

<div class="HTML" id="org5510e67">
<p>
&lt;div class="signature"&gt;
  <code>Warm regards,~&lt;br/&gt;
  ~The Sacha Theme</code>
&lt;/div&gt;
</p>

</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This is the first footnote explaining something important.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-15 Mon 00:00</p>
<p class="author">Author: Test Author</p>
<p class="date">Created: 2026-04-09 Thu 16:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
